In [1]:
import duckdb
from pathlib import Path
# import pandas as pd

Task 1 - EDA in python

In [73]:
# duckdb database path
duckdb_path = "data/sakila.duckdb"      # sets the path for the DuckDB database file
Path(duckdb_path).unlink(missing_ok=True)  # deletes the duckdb file if it already exists

# Ingest Sakila dataset into DuckDB
with duckdb.connect(duckdb_path) as conn, open("sql/load_sakila.sql") as ingest_scripts:  # opens a Duckdb connection and the SQL script file
    conn.sql(ingest_scripts.read()) # 

    description = conn.sql("DESC;").df()  # retrieves the description of the current database schema as a DataFrame
    actor = conn.sql("FROM actor;").df()  
    film = conn.sql("FROM film;").df() 
    film_actor = conn.sql("FROM film_actor;").df()
    rating = conn.sql("FROM film;").df() 
    
film.head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,<NA>,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2021-03-06 15:52:00
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,<NA>,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2021-03-06 15:52:00
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,<NA>,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2021-03-06 15:52:00
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,<NA>,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2021-03-06 15:52:00
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,<NA>,6,2.99,130,22.99,G,Deleted Scenes,2021-03-06 15:52:00

In [4]:

# read all tables into pandas DataFrames
with duckdb.connect(duckdb_path) as conn:
    table_names = conn.sql("SHOW TABLES").df()["name"].tolist()
    dfs = {table_name: conn.sql(f"SELECT * FROM {table_name}").df() for table_name in table_names}

dfs ["film"].head()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,<NA>,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2021-03-06 15:52:00
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,<NA>,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2021-03-06 15:52:00
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,<NA>,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2021-03-06 15:52:00
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,<NA>,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2021-03-06 15:52:00
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,<NA>,6,2.99,130,22.99,G,Deleted Scenes,2021-03-06 15:52:00

a) Which movies are longer than 3 hours (180 minutes), show the title and its length?

In [63]:
# film longer than 3 hours
film_long = duckdb.sql("""
    SELECT title, length, description, rating
    FROM film
    WHERE length > 180
""").df()
film_long.head()

,title,length,description,rating
0,ANALYZE HOOSIERS,181,A Thoughtful Display of a Explorer And a Pastr...,R
1,BAKED CLEOPATRA,182,A Stunning Drama of a Forensic Psychologist An...,G
2,CATCH AMISTAD,183,A Boring Reflection of a Lumberjack And a Femi...,G
3,CHICAGO NORTH,185,A Fateful Yarn of a Mad Cow And a Waitress who...,PG-13
4,CONSPIRACY SPIRIT,184,A Awe-Inspiring Story of a Student And a Frisb...,PG-13

In [6]:
len(film_long)

39

In [7]:

# Count the number of films in the film table
duckdb.sql( """SELECT * FROM film """).df()

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features,last_update
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,<NA>,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",2021-03-06 15:52:00
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,<NA>,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",2021-03-06 15:52:00
2,3,ADAPTATION HOLES,A Astounding Reflection of a Lumberjack And a ...,2006,1,<NA>,7,2.99,50,18.99,NC-17,"Trailers,Deleted Scenes",2021-03-06 15:52:00
3,4,AFFAIR PREJUDICE,A Fanciful Documentary of a Frisbee And a Lumb...,2006,1,<NA>,5,2.99,117,26.99,G,"Commentaries,Behind the Scenes",2021-03-06 15:52:00
4,5,AFRICAN EGG,A Fast-Paced Documentary of a Pastry Chef And ...,2006,1,<NA>,6,2.99,130,22.99,G,Deleted Scenes,2021-03-06 15:52:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,996,YOUNG LANGUAGE,A Unbelieveable Yarn of a Boat And a Database ...,2006,1,<NA>,6,0.99,183,9.99,G,"Trailers,Behind the Scenes",2021-03-06 15:52:08
996,997,YOUTH KICK,A Touching Drama of a Teacher And a Cat who mu...,2006,1,<NA>,4,0.99,179,14.99,NC-17,"Trailers,Behind the Scenes",2021-03-06 15:52:08
997,998,ZHIVAGO CORE,A Fateful Yarn of a Composer And a Man who mus...,2006,1,<NA>,6,0.99,105,10.99,NC-17,Deleted Scenes,2021-03-06 15:52:08
998,999,ZOOLANDER FICTION,A Fateful Reflection of a Waitress And a Boat ...,2006,1,<NA>,5,2.99,101,28.99,R,"Trailers,Deleted Scenes",2021-03-06 15:52:08
999,1000,ZORRO ARK,A Intrepid Panorama of a Mad Scientist And a B...,2006,1,<NA>,3,4.99,50,18.99,NC-17,"Trailers,Commentaries,Behind the Scenes",2021-03-06 15:52:08

b) Which movies have the word "love" in its title? Show the following columns
title
rating
length
description

In [82]:

duckdb.sql("""
            SELECT 
                title,
                rating,
                length,
                description
            FROM film
            WHERE lower (title) LIKE '%love%';
        """).df()

,title,rating,length,description
0,GRAFFITI LOVE,PG,117,A Unbelieveable Epistle of a Sumo Wrestler And...
1,IDAHO LOVE,PG-13,172,A Fast-Paced Drama of a Student And a Crocodil...
2,IDENTITY LOVER,PG-13,119,A Boring Tale of a Composer And a Mad Cow who ...
3,INDIAN LOVE,NC-17,135,A Insightful Saga of a Mad Scientist And a Mad...
4,LAWRENCE LOVE,NC-17,175,A Fanciful Yarn of a Database Administrator An...
5,LOVE SUICIDES,R,181,A Brilliant Panorama of a Hunter And a Explore...
6,LOVELY JINGLE,PG,65,A Fanciful Yarn of a Crocodile And a Forensic ...
7,LOVER TRUMAN,G,75,A Emotional Yarn of a Robot And a Boy who must...
8,LOVERBOY ATTACKS,PG-13,162,A Boring Story of a Car And a Butler who must ...
9,STRANGELOVE DESIRE,NC-17,103,A Awe-Inspiring Panorama of a Lumberjack And a...

c) Calculate descriptive statistics on the length column, The Manager wants, shortest, average, median and longest movie length

In [205]:
length_statistics = duckdb.sql("""
    SELECT
        MIN(length) AS shortest_length,
        ROUND(AVG(length)) AS average_length,
        MEDIAN(length) AS median_length,
        MAX(length) AS longest_length
    FROM film
""").df()

length_statistics.head()

   shortest_length  average_length  median_length  longest_length
0               46           115.0          114.0             185

d) The 10 most expensive movies to rent per day.

In [85]:

most_expensive_rentals = duckdb.sql(""" 
    SELECT title, 
            rental_rate, 
            rental_duration,
            (rental_rate / rental_duration) AS cost_per_day 
    FROM film
    ORDER BY cost_per_day ASC 
    LIMIT 10
""").df() 

most_expensive_rentals.head()

                 title  rental_rate  rental_duration  cost_per_day
0      ANONYMOUS HUMAN         0.99                7      0.141429
1    BOONDOCK BALLROOM         0.99                7      0.141429
2         CANYON STOCK         0.99                7      0.141429
3       BRIDE INTRIGUE         0.99                7      0.141429
4  BORROWERS BEDAZZLED         0.99                7      0.141429

In [86]:
duckdb.sql(""" 
    SELECT title, 
            rental_rate, 
            rental_duration,
            (rental_rate / rental_duration) AS cost_per_day 
    FROM film
    ORDER BY cost_per_day ASC 
    LIMIT 10
""").df()

                 title  rental_rate  rental_duration  cost_per_day
0      ANONYMOUS HUMAN         0.99                7      0.141429
1    BOONDOCK BALLROOM         0.99                7      0.141429
2         CANYON STOCK         0.99                7      0.141429
3       BRIDE INTRIGUE         0.99                7      0.141429
4  BORROWERS BEDAZZLED         0.99                7      0.141429
5        CATCH AMISTAD         0.99                7      0.141429
6         CARRIE BUNCH         0.99                7      0.141429
7       CELEBRITY HORN         0.99                7      0.141429
8       ARGONAUTS TOWN         0.99                7      0.141429
9  CHRISTMAS MOONSHINE         0.99                7      0.141429

e) The top 10 actors with the number of movies they have
played in.

In [72]:

dfs["actor"].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   actor_id     200 non-null    float64
 1   first_name   200 non-null    object
 2   last_name    200 non-null    object
 3   last_update  200 non-null    datetime64[us]
dtypes: datetime64[us](1), float64(1), object(2)
memory usage: 6.4+ KB

In [52]:
dfs["actor"].head()

   actor_id first_name     last_name         last_update
0       1.0   PENELOPE       GUINESS 2021-03-06 15:51:59
1       2.0       NICK      WAHLBERG 2021-03-06 15:51:59
2       3.0         ED         CHASE 2021-03-06 15:51:59
3       4.0   JENNIFER         DAVIS 2021-03-06 15:51:59
4       5.0     JOHNNY  LOLLOBRIGIDA 2021-03-06 15:51:59

In [58]:
len(dfs["actor"])

200

In [45]:
duckdb.sql("""
    SELECT 
        actor_id,
        first_name,
        last_name,
        
    FROM actor 
    limit 10
    

""").df()

   actor_id first_name     last_name
0       1.0   PENELOPE       GUINESS
1       2.0       NICK      WAHLBERG
2       3.0         ED         CHASE
3       4.0   JENNIFER         DAVIS
4       5.0     JOHNNY  LOLLOBRIGIDA
5       6.0      BETTE     NICHOLSON
6       7.0      GRACE        MOSTEL
7       8.0    MATTHEW     JOHANSSON
8       9.0        JOE         SWANK
9      10.0  CHRISTIAN         GABLE

# F) Write down 3-5 questions

1. What are the 5 longest movies

In [ ]:
longest_films = duckdb.sql("""
    SELECT title, length
    FROM film
    ORDER BY length DESC  ###################
    LIMIT 5
""").df()

longest_films.head()

2. Select movies starting with the letter A

In [243]:
film_a = duckdb.sql("""
    SELECT title
    FROM film
    Where title LIKE 'A%'
    order BY title ASC
""").df()

film_a.head()

              title
0  ANALYZE HOOSIERS

3.